In [2]:
import pandas as pd
india_weather=pd.DataFrame({
    "city":["mumbai","delhi","bangalore"],
    "temperature":[32,45,30],
    "humidity":[80,60,78]
})
india_weather

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78

In [4]:
us_weather=pd.DataFrame({
    "city":["new york","chicago","orlando"],
    "temperature":[21,35,33],
    "humidity":[68,65,75]
})
us_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           35        65
2   orlando           33        75

In [13]:
df=pd.concat([india_weather,us_weather],keys=["india","US"])
df

              city  temperature  humidity
india 0     mumbai           32        80
      1      delhi           45        60
      2  bangalore           30        78
US    0   new york           21        68
      1    chicago           35        65
      2    orlando           33        75

In [18]:
df.loc["US"]

       city  temperature  humidity
0  new york           21        68
1   chicago           35        65
2   orlando           33        75